# Temas vistos el 5 de diciembre del 2022
[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/danielroa98/Postgrad-ML/blob/main/Module-1/30_Nov_2022_lec_07_M1G6P_DRG.ipynb)

Library imports

In [33]:
import os
import pandas as pd
import numpy as np

## Módulo OS

El módulo OS de Python nos permite interactuar con el sistema operativo y viene incluído en los _standard utility modules_.

### Current working directory `cwd`

In [ ]:
cwd = os.getcwd()
print(f'My current working directory is "{cwd}"')

#### Se puede cambiar el directorio donde se está trabajando

Usando el método `chdir()`

In [ ]:
def current_dir():
    print(os.getcwd(),'\n')

In [ ]:
# Equivalente al módulo `getcwd()`
current_dir()

In [ ]:
os.chdir('../')
current_dir()

In [ ]:
# Para obtener el contenido del directorio completo
os.listdir()

In [ ]:
# Para volver al dir original
os.chdir(cwd)

### Creación de carpetas/directorios

#### `mkdir()` vs `makedirs()`

`os.mkdir()` crea directorios en el _path_ descrito/ya existente

In [ ]:
testDir = 'DATA Test 5-Dec-2022'
currPath = os.getcwd() # -> this is an existing path.

path = os.path.join(currPath, testDir)

os.mkdir(path)

In [ ]:
# Usado para confirmar que el directorio se haya creado correctamente.
os.listdir()

`makedirs()` puede generar directorios en caso que no existan, genera carpetas de manera recursiva.

- Una vez que crea la última carpeta, en caso que llegue a ser necesario, también crea las carpetas de la ruta que __no existían__.

In [ ]:
testDir = 'DS test makedirs'

# El directorio 'Prueba' es inexistente
currPath = '.../../Module-1/Prueba'

path = os.path.join(currPath, testDir)

os.makedirs(path)

In [ ]:
# os.listdir()

os.listdir('.../../Module-1/Prueba')

### Eliminación de carpetas/directorios

Para eliminar directorios o archivos específicos, se utilizan los métodos `remove()` y `rmdir()`.

#### `remove()`

- Usado para quitar el archivo de una ruta.
- NO puede eliminar una carpeta.

In [ ]:
testFile = 'file_to_delete.txt'

curDir = '.../../Module-1'

path = os.path.join(curDir, testFile)

os.remove(path)

In [ ]:
os.listdir()

#### `rmdir()`

- Usado para eliminar una carpeta __vacía__.

In [ ]:
folder = 'DATA Test 5-Dec-2022'
testDir = '.../../Module-1'

path = os.path.join(testDir, folder)

In [ ]:
os.rmdir(path)

## DataFrames, continuation for `loc[]` and `iloc[]`

Continuación de la clase del [30-Nov-2022](./30_Nov_2022_lec_07_M1G6P_DRG.ipynb)

In [34]:
emp = pd.read_csv('./Datasets/employees_3.csv', parse_dates=['Start Date'], index_col='Start Date')

emp.head(4)

,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
Start Date,,,,,,,
1993-08-06,Douglas,Male,12:42 p.m.,97308,6.945,True,Marketing
1996-03-31,Thomas,Male,6:53 a.m.,61933,4.170,True,NaN
1993-04-23,Maria,Female,11:17 a.m.,130590,11.858,False,Finance
2005-03-04,Jerry,Male,1:00 p.m.,138705,9.340,True,Finance

In [35]:
emp.iloc[10:12, [0,1,3]]

           First Name  Gender  Salary
Start Date
1980-08-12     Louise  Female   63241
1997-10-26      Julie  Female  102508

In [36]:
emp.reset_index(inplace=True)
emp.head(3)

,Start Date,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
0,1993-08-06,Douglas,Male,12:42 p.m.,97308,6.945,True,Marketing
1,1996-03-31,Thomas,Male,6:53 a.m.,61933,4.170,True,NaN
2,1993-04-23,Maria,Female,11:17 a.m.,130590,11.858,False,Finance

Cambiar una celda: intersection row-col

```python
df.loc[row, col]
```

In [37]:
emp.loc[1,'Team'] = 'Marketing'
emp.head(3)

,Start Date,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
0,1993-08-06,Douglas,Male,12:42 p.m.,97308,6.945,True,Marketing
1,1996-03-31,Thomas,Male,6:53 a.m.,61933,4.170,True,Marketing
2,1993-04-23,Maria,Female,11:17 a.m.,130590,11.858,False,Finance

Si se quieren cambiar múltiples valores.

In [39]:
emp.loc[1, ['Bonus %', 'Team']] = [5, "Finance"]
emp.head(3)

,Start Date,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
0,1993-08-06,Douglas,Male,12:42 p.m.,97308,6.945,True,Marketing
1,1996-03-31,Thomas,Male,6:53 a.m.,61933,5.000,True,Finance
2,1993-04-23,Maria,Female,11:17 a.m.,130590,11.858,False,Finance

In [40]:
emp.set_index('First Name', inplace=True)

In [41]:
emp.head(3)

,Start Date,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Douglas,1993-08-06,Male,12:42 p.m.,97308,6.945,True,Marketing
Thomas,1996-03-31,Male,6:53 a.m.,61933,5.000,True,Finance
Maria,1993-04-23,Female,11:17 a.m.,130590,11.858,False,Finance

In [42]:
emp.index.isna()

array([False, False, False, False, False, False, False,  True, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False,  True, False,  True, False,
       False, False])

In [43]:
emp[emp.index.isna()].loc[:, ['Gender', 'Start Date']]

            Gender Start Date
First Name
NaN         Female 2015-07-20
NaN           Male 2012-06-14
NaN           Male 2012-10-08

In [45]:
emp = pd.read_csv('./Datasets/employees_2.csv', parse_dates=['Start Date'])
emp.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance

In [46]:
emp.set_index('Start Date', inplace=True)
emp.head(3)

,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
Start Date,,,,,,,
1993-08-06,Douglas,Male,12:42 PM,97308,6.945,True,Marketing
1996-03-31,Thomas,Male,6:53 AM,61933,4.170,True,NaN
1993-04-23,Maria,Female,11:17 AM,130590,11.858,False,Finance

In [47]:
emp.sort_index(inplace=True)
emp.head(10)

,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
Start Date,,,,,,,
1980-01-19,Joe,Male,4:06 PM,119667,1.148,True,Finance
1980-01-24,Chris,NaN,12:13 PM,113590,3.055,False,Sales
1980-01-28,Ruby,Female,11:08 PM,142868,6.318,False,Marketing
1980-02-20,Fred,Male,2:25 AM,74129,18.225,False,Product
1980-02-25,Sara,Female,10:50 PM,75484,3.186,False,Finance
1980-03-08,Julie,Female,5:13 AM,145357,3.459,False,Engineering
1980-03-30,Steven,Male,9:20 PM,35095,8.379,True,Client Services
1980-04-01,NaN,Female,8:04 PM,48141,12.605,NaN,NaN
1980-04-17,Roger,Male,11:32 AM,88010,13.886,True,Sales
1980-04-20,NaN,Male,1:17 PM,71520,13.248,NaN,Engineering

In [48]:
emp['First Name'].value_counts()

Marilyn    11
Jeremy     10
Todd       10
Barbara    10
Rose        9
           ..
Angela      1
Brian       1
Tammy       1
David       1
Jean        1
Name: First Name, Length: 200, dtype: int64

In [58]:
## The index was applied a 'reset_index' in order to better check if the values in the index were correct.
emp.reset_index(inplace=True)
emp.head(3)

,Start Date,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
0,1980-01-19,Joe,Male,4:06 PM,119667,1.148,True,Finance
1,1980-01-24,Chris,NaN,12:13 PM,113590,3.055,False,Sales
2,1980-01-28,Ruby,Female,11:08 PM,142868,6.318,False,Marketing

In [62]:
is_Jeremy = emp['First Name'] == 'Jeremy'
is_Jeremy

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: First Name, Length: 1000, dtype: bool

In [63]:
# Para conocer si hay al menos un "True"
any(is_Jeremy)

True

In [64]:
is_Jeremy.sum()

10

#### `idxmax()`

Método que nos indica la posición donde se encuentra el valor máximo.

In [65]:
# La posición donde occure el primer "True" de la serie
is_Jeremy.idxmax()

40